tap "azure/functions"
tap "epk/epk"
tap "espanso/espanso"
tap "gittower/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "snyk/tap"
tap "wezterm/wezterm", "https://github.com/wezterm/homebrew-wezterm.git"
# Library for manipulating PNG images
brew "libpng"
# TIFF library and utilities
brew "libtiff"
# Record and share terminal sessions
brew "asciinema", link: false
# Azure Storage data transfer utility
brew "azcopy"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# User-friendly launcher for Bazel
brew "bazelisk"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Asynchronous event library
brew "libevent"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Postgres C API library
brew "libpq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Language Server Protocol for Markdown
brew "marksman"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk@17"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Software environment for statistical computing
brew "r"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Rust toolchain installer
brew "rustup"
# Security health metrics for Open Source
brew "scorecard"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Tool Command Language
brew "tcl-tk"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Code-search similar to ack
brew "the_silver_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Next generation frontend tooling. It's fast!
brew "vite"
# Internet file retriever
brew "wget"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Audio utility
cask "background-music"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Family of tools to build, test and package software
cask "cmake-app"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to hide status bar icons
cask "dozer"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Utility for customizing which browser to start
cask "finicky"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"
# 2D and 3D game engine
cask "godot"
# Menu bar manager
cask "jordanbaird-ice"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Customise mouse behavior
cask "linearmouse"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Visual diff and merge tool
cask "meld"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# Control your tools with a few keystrokes
cask "raycast"
# Spotify and iTunes in the menu bar
cask "spotmenu"
# Menu bar manager
cask "thaw"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
cargo "cargo-nextest"
cargo "cargo-swift"
cargo "cargo-xcode"
cargo "just"
npm "@commitlint/cli"
npm "@commitlint/config-conventional"
npm "@microsoft/inshellisense"
npm "alex"
npm "better-commits"
npm "corepack"
npm "cspell"
npm "dockly"
npm "eslint"
npm "jsonlint"
npm "markdownlint-cli"
npm "neovim"
npm "prettier"
npm "textlint"
npm "write-good"
npm "yaml"
