#!/bin/zsh
#
# .zsh_plugins.txt - antidote plugins file
#

### Overview
#
# The `.zsh_plugins.txt` file is used by antidote to configure Zsh bundles. Bundles are
# just a fancy way of referring to Zsh utilities, frameworks, prompts, or plugins.
# `.zsh_plugins.txt` is used by antidote to generate a static `.zsh_plugins.zsh` file,
# which can then be sourced in your `.zshrc`. You can use this file as a starting point
# for your own config. Strip out instructional comments (ie: lines beginning with a '#')
# and any plugins you don't need, then add what you like and make it yours!
#
# NOTE: Order matters in this file! Some bundles need to be last, and others are
# prerequisites. Read the documentation for the plugins you use to ensure proper
# configuration.
#
###

romkatv/powerlevel10k

# OMZ plugins
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/command-not-found

# ### Completions
# #
# # You may want to add some additional completions to Zsh. Completions look in your fpath
# # for completion functions, which are functions named with a leading underscore
# # (eg: _git). You need to add all supplemental completions to your fpath prior to
# # running `compinit` to use completions functionality properly. You will want to find
# # a completion plugin that runs `compinit` for you, or you can run it yourself in
# # your .zshrc after antidote loads like this:
# #
# #   autoload -Uz compinit && compinit
# #
# ###

# completions
ohmyzsh/ohmyzsh path:plugins/docker/completions kind:fpath
ohmyzsh/ohmyzsh path:plugins/docker-compose kind:fpath
ohmyzsh/ohmyzsh path:plugins/ag kind:fpath
git/git path:blob/master/contrib/completion kind:fpath

# TODO: make this portable
/opt/homebrew/share/zsh/site-functions kind:fpath

# # Compinit plugins should be near the end of .zsh_plugins.txt so that $fpath has been
# # fully populated. Use zsh-utils for its completion plugin.
# belak/zsh-utils path:completion

marlonrichert/zsh-autocomplete

### Final Plugins
#
# Remember plugin order matters! Put plugins that need run last at the bottom of your
# .zsh_plugins.txt file.
#
###

# These popular core plugins should be loaded at the end
zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-history-substring-search
